### [ env/poc ] terraform plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azuread_application.gha-app will be destroyed
  # (because azuread_application.gha-app is not in configuration)
  - resource "azuread_application" "gha-app" {
      - app_role_ids                   = {} -> null
      - client_id                      = "25c42509-602d-46c2-bffd-fb01e1cda243" -> null
      - device_only_auth_enabled       = false -> null
      - display_name                   = "faspo-poc-gha-test-app" -> null
      - fallback_public_client_enabled = false -> null
      - group_membership_claims        = [] -> null
      - id                             = "/applications/dfc501f1-a733-4c6a-b046-3d6a914e9756" -> null
      - identifier_uris                = [] -> null
      - oauth2_permission_scope_ids    = {} -> null
      - oauth2_post_response_required  = false -> null
      - object_id                      = "dfc501f1-a733-4c6a-b046-3d6a914e9756" -> null
      - owners                         = [] -> null
      - prevent_duplicate_names        = true -> null
      - publisher_domain               = "safarjnoutlook.onmicrosoft.com" -> null
      - sign_in_audience               = "AzureADMyOrg" -> null
      - tags                           = [] -> null
        # (11 unchanged attributes hidden)

      - api {
          - known_client_applications      = [] -> null
          - mapped_claims_enabled          = false -> null
          - requested_access_token_version = 1 -> null
        }

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - optional_claims {
        }

      - public_client {
          - redirect_uris = [] -> null
        }

      - single_page_application {
          - redirect_uris = [] -> null
        }

      - web {
          - redirect_uris = [] -> null
            # (2 unchanged attributes hidden)

          - implicit_grant {
              - access_token_issuance_enabled = false -> null
              - id_token_issuance_enabled     = false -> null
            }
        }
    }

  # azuread_application.store-service-gha-app will be created
  + resource "azuread_application" "store-service-gha-app" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "faspo-poc-store-service-gha"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = true
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)
    }

  # azuread_application_federated_identity_credential.gha-app-fc will be destroyed
  # (because azuread_application_federated_identity_credential.gha-app-fc is not in configuration)
  - resource "azuread_application_federated_identity_credential" "gha-app-fc" {
      - application_id = "/applications/dfc501f1-a733-4c6a-b046-3d6a914e9756" -> null
      - audiences      = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id  = "a99bf9a1-ed35-4126-acbb-43cb4f04071d" -> null
      - display_name   = "faspo-poc-gha-test-app-fc" -> null
      - id             = "dfc501f1-a733-4c6a-b046-3d6a914e9756/federatedIdentityCredential/a99bf9a1-ed35-4126-acbb-43cb4f04071d" -> null
      - issuer         = "https://token.actions.githubusercontent.com" -> null
      - subject        = "repo:scoring-system-poc/test-app:ref:refs/heads/main" -> null
        # (1 unchanged attribute hidden)
    }

  # azuread_application_federated_identity_credential.store-service-gha-app-fc will be created
  + resource "azuread_application_federated_identity_credential" "store-service-gha-app-fc" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + display_name   = "faspo-poc-store-service-gha-fc"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:scoring-system-poc/faspo-store-service:ref:refs/heads/main"
    }

  # azuread_service_principal.gha-app-sp will be destroyed
  # (because azuread_service_principal.gha-app-sp is not in configuration)
  - resource "azuread_service_principal" "gha-app-sp" {
      - account_enabled               = true -> null
      - alternative_names             = [] -> null
      - app_role_assignment_required  = false -> null
      - app_role_ids                  = {} -> null
      - app_roles                     = [] -> null
      - application_tenant_id         = "d46035c4-e4ae-4ea6-904f-6f343b7b5673" -> null
      - client_id                     = "25c42509-602d-46c2-bffd-fb01e1cda243" -> null
      - display_name                  = "faspo-poc-gha-test-app" -> null
      - id                            = "/servicePrincipals/cc38cf91-47db-41cc-87c6-9052cee66428" -> null
      - notification_email_addresses  = [] -> null
      - oauth2_permission_scope_ids   = {} -> null
      - oauth2_permission_scopes      = [] -> null
      - object_id                     = "cc38cf91-47db-41cc-87c6-9052cee66428" -> null
      - owners                        = [] -> null
      - redirect_uris                 = [] -> null
      - service_principal_names       = [] -> null
      - sign_in_audience              = "AzureADMyOrg" -> null
      - tags                          = [] -> null
      - type                          = "Application" -> null
        # (7 unchanged attributes hidden)

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - features {
          - custom_single_sign_on_app = false -> null
          - enterprise_application    = false -> null
          - gallery_application       = false -> null
          - visible_to_users          = true -> null
        }

      - saml_single_sign_on {
            # (1 unchanged attribute hidden)
        }
    }

  # azuread_service_principal.store-service-gha-sp will be created
  + resource "azuread_service_principal" "store-service-gha-sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # azurerm_cosmosdb_sql_container.codetable-container will be created
  + resource "azurerm_cosmosdb_sql_container" "codetable-container" {
      + account_name        = "faspo-poc-cdb"
      + database_name       = "faspo-poc-cdb"
      + id                  = (known after apply)
      + name                = "codetable"
      + partition_key_kind  = "Hash"
      + partition_key_paths = [
          + "/id",
        ]
      + resource_group_name = "faspo-poc-data-rg"
      + throughput          = (known after apply)

      + conflict_resolution_policy (known after apply)

      + indexing_policy (known after apply)
    }

  # azurerm_cosmosdb_sql_container.document-container will be created
  + resource "azurerm_cosmosdb_sql_container" "document-container" {
      + account_name        = "faspo-poc-cdb"
      + database_name       = "faspo-poc-cdb"
      + default_ttl         = -1
      + id                  = (known after apply)
      + name                = "document"
      + partition_key_kind  = "Hash"
      + partition_key_paths = [
          + "/subjectId",
        ]
      + resource_group_name = "faspo-poc-data-rg"
      + throughput          = (known after apply)

      + conflict_resolution_policy (known after apply)

      + indexing_policy {
          + indexing_mode = "consistent"

          + excluded_path {
              + path = "/_etag/?"
            }
          + excluded_path {
              + path = "/items/*"
            }

          + included_path {
              + path = "/*"
            }
        }
    }

  # azurerm_cosmosdb_sql_container.metadata-container will be created
  + resource "azurerm_cosmosdb_sql_container" "metadata-container" {
      + account_name        = "faspo-poc-cdb"
      + database_name       = "faspo-poc-cdb"
      + id                  = (known after apply)
      + name                = "metadata"
      + partition_key_kind  = "Hash"
      + partition_key_paths = [
          + "/id",
        ]
      + resource_group_name = "faspo-poc-data-rg"
      + throughput          = (known after apply)

      + conflict_resolution_policy (known after apply)

      + indexing_policy (known after apply)
    }

  # azurerm_cosmosdb_sql_container.subject-container will be created
  + resource "azurerm_cosmosdb_sql_container" "subject-container" {
      + account_name        = "faspo-poc-cdb"
      + database_name       = "faspo-poc-cdb"
      + id                  = (known after apply)
      + name                = "subject"
      + partition_key_kind  = "Hash"
      + partition_key_paths = [
          + "/id",
        ]
      + resource_group_name = "faspo-poc-data-rg"
      + throughput          = (known after apply)

      + conflict_resolution_policy (known after apply)

      + indexing_policy (known after apply)
    }

  # azurerm_cosmosdb_sql_role_assignment.store-service-cdb-rbac will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "store-service-cdb-rbac" {
      + account_name        = "faspo-poc-cdb"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = (known after apply)
      + resource_group_name = "faspo-poc-data-rg"
      + role_definition_id  = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.DocumentDB/databaseAccounts/faspo-poc-cdb/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.DocumentDB/databaseAccounts/faspo-poc-cdb"
    }

  # azurerm_cosmosdb_sql_role_assignment.test-app-cdb-rbac will be destroyed
  # (because azurerm_cosmosdb_sql_role_assignment.test-app-cdb-rbac is not in configuration)
  - resource "azurerm_cosmosdb_sql_role_assignment" "test-app-cdb-rbac" {
      - account_name        = "faspo-poc-cdb" -> null
      - id                  = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.DocumentDB/databaseAccounts/faspo-poc-cdb/sqlRoleAssignments/681ca54e-654e-0898-5e38-38fae40ebc59" -> null
      - name                = "681ca54e-654e-0898-5e38-38fae40ebc59" -> null
      - principal_id        = "4cd265ff-c760-4516-8ba1-cea230646254" -> null
      - resource_group_name = "faspo-poc-data-rg" -> null
      - role_definition_id  = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.DocumentDB/databaseAccounts/faspo-poc-cdb/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> null
      - scope               = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.DocumentDB/databaseAccounts/faspo-poc-cdb" -> null
    }

  # azurerm_federated_identity_credential.store-service-uami-fc will be created
  + resource "azurerm_federated_identity_credential" "store-service-uami-fc" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://germanywestcentral.oic.prod-aks.azure.com/d46035c4-e4ae-4ea6-904f-6f343b7b5673/58ceca04-e42f-4ca8-8369-4440618029ca/"
      + name                = "faspo-poc-store-service-uami-fc"
      + parent_id           = (known after apply)
      + resource_group_name = "faspo-poc-sec-rg"
      + subject             = "system:serviceaccount:faspo-poc-apps:faspo-poc-store-service-sa"
    }

  # azurerm_federated_identity_credential.test-app-uami-fc will be destroyed
  # (because azurerm_federated_identity_credential.test-app-uami-fc is not in configuration)
  - resource "azurerm_federated_identity_credential" "test-app-uami-fc" {
      - audience            = [
          - "api://AzureADTokenExchange",
        ] -> null
      - id                  = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-sec-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/faspo-poc-test-app-uami/federatedIdentityCredentials/faspo-poc-test-app-uami-fc" -> null
      - issuer              = "https://germanywestcentral.oic.prod-aks.azure.com/d46035c4-e4ae-4ea6-904f-6f343b7b5673/58ceca04-e42f-4ca8-8369-4440618029ca/" -> null
      - name                = "faspo-poc-test-app-uami-fc" -> null
      - parent_id           = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-sec-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/faspo-poc-test-app-uami" -> null
      - resource_group_name = "faspo-poc-sec-rg" -> null
      - subject             = "system:serviceaccount:faspo-poc-apps:faspo-poc-test-app-sa" -> null
    }

  # azurerm_role_assignment.gha-acr-rbac will be destroyed
  # (because azurerm_role_assignment.gha-acr-rbac is not in configuration)
  - resource "azurerm_role_assignment" "gha-acr-rbac" {
      - id                                     = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.ContainerRegistry/registries/faspopocacr/providers/Microsoft.Authorization/roleAssignments/e8cd6ae1-5935-02b6-a6b0-f945bb86039a" -> null
      - name                                   = "e8cd6ae1-5935-02b6-a6b0-f945bb86039a" -> null
      - principal_id                           = "cc38cf91-47db-41cc-87c6-9052cee66428" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/providers/Microsoft.Authorization/roleDefinitions/8311e382-0749-4cb8-b61a-304f252e45ec" -> null
      - role_definition_name                   = "AcrPush" -> null
      - scope                                  = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.ContainerRegistry/registries/faspopocacr" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.store-service-gha-acr-rbac will be created
  + resource "azurerm_role_assignment" "store-service-gha-acr-rbac" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPush"
      + scope                            = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.ContainerRegistry/registries/faspopocacr"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.store-service-uami will be created
  + resource "azurerm_user_assigned_identity" "store-service-uami" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "germanywestcentral"
      + name                = "faspo-poc-store-service-uami"
      + principal_id        = (known after apply)
      + resource_group_name = "faspo-poc-sec-rg"
      + tenant_id           = (known after apply)
    }

  # azurerm_user_assigned_identity.test-app-uami will be destroyed
  # (because azurerm_user_assigned_identity.test-app-uami is not in configuration)
  - resource "azurerm_user_assigned_identity" "test-app-uami" {
      - client_id           = "70e791b0-046c-46c7-8d4d-840b1c73ce66" -> null
      - id                  = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-sec-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/faspo-poc-test-app-uami" -> null
      - location            = "germanywestcentral" -> null
      - name                = "faspo-poc-test-app-uami" -> null
      - principal_id        = "4cd265ff-c760-4516-8ba1-cea230646254" -> null
      - resource_group_name = "faspo-poc-sec-rg" -> null
      - tags                = {} -> null
      - tenant_id           = "d46035c4-e4ae-4ea6-904f-6f343b7b5673" -> null
    }

Plan: 11 to add, 0 to change, 7 to destroy.
```
